{
  "backend/main.mo": "Motoko canister defining access-controlled user profiles, inventory, shipments, logs, facilities, and CRM relationships with CRUD and query methods.",
  "feature_evidence.json": "Feature evidence report mapping frontend theme and UI polish tasks to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/index.css": "Global Tailwind base styles with custom OKLCH color tokens and light/dark mode variables.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app controlling authentication flow, profile setup, dashboard rendering, and theme provider.",
  "frontend/src/components/CRMTab.tsx": "CRM management tab for creating, editing, deleting, and annotating medical facility relationships.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard summary showing inventory totals, low stock, pending shipments, and system metrics with loading skeletons.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an icon, message, and optional action.",
  "frontend/src/components/FacilityTab.tsx": "Displays and manages health facilities with add dialog and list loading states.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows app header with branding, theme toggle, and user account menu with logout.",
  "frontend/src/components/InventoryTab.tsx": "Manages inventory items including search, add item dialog, and quantity updates.",
  "frontend/src/components/LoginPrompt.tsx": "Landing screen prompting users to log in using Internet Identity with feature highlights.",
  "frontend/src/components/MovementTab.tsx": "Handles logging and displaying equipment movement between locations.",
  "frontend/src/components/PageHeader.tsx": "Reusable page header component with title, description, and optional action slot.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user's name and contact information on first setup.",
  "frontend/src/components/ReportTab.tsx": "Provides UI for generating summary and per-hospital reports, handling date inputs, API mutations, and displaying results.",
  "frontend/src/components/ShipmentTab.tsx": "Manages shipment creation and status updates, showing shipment lists and dialogs for selecting destinations and equipment.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing and loading identities, and exposing login and logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations such as inventory, shipments, user profiles, dashboard data, and reports.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark healthcare-themed UI color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard page with tab navigation and renders overview, inventory, shipment, movement, facility, CRM, and report components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URLs or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, container settings, plugins, and extended theme values for the project.",
  "project_state.json": "Describes current project state, including feature summaries, versions, and architecture details for the MediDistribusi app."
}