{
  "backend/main.mo": "Motoko canister defining access-controlled user profiles, inventories, shipments, movement logs, healthcare facilities, and CRM relations with CRUD and query methods.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented UI/UX improvements with associated components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI roles of various frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH theme tokens, light/dark mode variables, and base styling for borders and backgrounds.",
  "frontend/index.html": "Minimal HTML entry point that loads the React application via main.tsx and provides the root mounting element.",
  "frontend/src/App.tsx": "Top-level React component managing authentication state, profile setup flow, theming, and high-level layout with header, footer, and dashboard.",
  "frontend/src/components/CRMTab.tsx": "CRM management tab enabling creation, editing, deletion, and note‑taking for medical service relationships with responsive UI dialogs and search.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard overview displaying summary metrics, low‑stock alerts, and pending shipments using responsive cards and loading skeletons.",
  "frontend/src/components/EmptyState.tsx": "Displays a centered empty-state UI with an icon, title, optional description, and optional action button.",
  "frontend/src/components/FacilityTab.tsx": "Fetches and lists healthcare facilities, with a dialog to add new facilities and loading/empty states.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with branding, theme toggle, and authenticated user menu including logout.",
  "frontend/src/components/InventoryTab.tsx": "Manages inventory items with search, add-item dialog, quantity update dialog, and stock status badges.",
  "frontend/src/components/LoginPrompt.tsx": "Presents a login landing page with branding, login button, and feature highlight cards.",
  "frontend/src/components/MovementTab.tsx": "Displays movement logs and provides a form to record equipment movements between locations.",
  "frontend/src/components/PageHeader.tsx": "Renders a page section header with a title, optional description, and optional action element.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects and submits the user's name and contact number using a saveProfile mutation.",
  "frontend/src/components/ReportTab.tsx": "UI for generating summary and hospital-specific reports, handling date input, API calls, and displaying results.",
  "frontend/src/components/ShipmentTab.tsx": "Tab for listing, creating, and updating shipments, including destination selection, equipment selection, and status updates.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, identity persistence, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, inventory, shipments, reports, and admin checks.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variable theme tokens for light and dark modes, including colors, radius, and typography utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, sets up React Query and the InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the dashboard page with tab-based navigation and renders content components for each tab using scrollable, responsive UI elements.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, persisting, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color tokens mapped to CSS variables, custom radius, shadows, container settings, and plugin integrations.",
  "project_state.json": "Describes the project state, requirements, existing features, and pending UI template enhancement request metadata."
}