{
  "kind": "build_request",
  "title": "Modernize and polish the MediDistribusi UI/UX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a cohesive modern visual theme across the entire frontend (login, header, dashboard, and all tabs) by updating Tailwind theme tokens (CSS variables), typography scale, spacing, and component composition to feel more polished and consistent in both light and dark mode. Choose a distinct, professional healthcare-appropriate style (avoid a blue/purple-dominant palette unless explicitly required) and enforce it consistently across pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "buat kan tampilan yang modern dan bagus"
        ]
      },
      "acceptanceCriteria": [
        "Light mode and dark mode both have strong contrast, readable typography, and consistent component styling.",
        "The visual theme is consistent across the login screen, header, dashboard shell, and each tab (Overview, Inventory, Shipments, Movements, Facilities, CRM, Reports).",
        "Theme changes are implemented via existing theme tokens (e.g., variables in frontend/src/index.css) rather than ad-hoc one-off colors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Polish key screens to look modern: refine the Header branding block, improve the Dashboard tab navigation responsiveness and visual hierarchy, and upgrade major content containers (cards, tables/lists, dialogs, forms) with better spacing, alignment, and consistent empty/loading states—without modifying read-only shadcn/ui component sources.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "buat kan tampilan yang modern dan bagus"
        ]
      },
      "acceptanceCriteria": [
        "Header remains sticky and clean, with improved brand presentation and a visually balanced user dropdown trigger.",
        "Dashboard tab list is visually clear and responsive (works well on mobile and desktop), and active/hover states are clearly communicated.",
        "Primary UI surfaces (cards, dialogs, forms) have consistent padding, border radius, shadows, and focus states aligned with the new theme.",
        "No changes are made to any files under frontend/src/components/ui; improvements are achieved by composing these components and adjusting app-level styles/layout."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (including frontend/src/components/ui and Internet Identity hooks).",
    "Do not modify shadcn/ui component source files; only compose them and adjust app-level styling/tokens.",
    "Keep the existing feature set and navigation structure (tabs and flows) intact; this request is UI/UX modernization only."
  ],
  "nonGoals": [
    "Adding new backend features or changing Motoko data models/APIs.",
    "Reworking business logic (inventory, shipments, movements, CRM, reports).",
    "Introducing third-party authentication providers or non-supported frameworks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}