{
  "kind": "build_request",
  "title": "Apply a responsive, modern, simple UI template across the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a cohesive, responsive, modern, and simple visual theme across the entire frontend (login, header, dashboard, and all tabs) using Tailwind tokens/CSS variables, consistent typography, spacing, and elevation in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "template yang responsipf dan modern,simple"
        ]
      },
      "acceptanceCriteria": [
        "A single, consistent visual theme is clearly applied across LoginPrompt, Header, Dashboard, and all tab screens.",
        "Light and dark mode both look polished and readable (contrast, borders, shadows, text hierarchy).",
        "The design remains simple (no overly decorative gradients/background effects beyond subtle accents)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the app layout is fully responsive across common breakpoints (mobile, tablet, desktop): improve the header branding block, dashboard tab navigation, and primary content containers so they adapt cleanly without overflow or cramped spacing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "template yang responsipf dan modern,simple"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the header content does not overflow; key actions (theme toggle, account menu/login state) remain accessible.",
        "Dashboard tab navigation remains usable on mobile (horizontal scroll works, active state is clear, labels/icons do not collide).",
        "All major screens (overview, inventory, shipment, movement, facility, CRM, report) render without horizontal scrolling at typical mobile widths."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Polish and simplify the UI composition of major content elements (cards, tables/lists, dialogs, forms, empty/loading states) to feel modern and consistent while keeping interactions and existing features unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "template yang responsipf dan modern,simple"
        ]
      },
      "acceptanceCriteria": [
        "Cards, forms, and dialogs use consistent padding, border radius, and spacing across all tabs.",
        "Empty states and loading states look consistent and aligned with the chosen theme.",
        "No existing functional behavior is removed or broken (CRUD flows, navigation, and auth flow still work as before)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui.",
    "Frontend changes only; do not change backend behavior or data models for this request."
  ],
  "nonGoals": [
    "Adding new product features (new tabs, new entities, new workflows).",
    "Changing authentication providers (Internet Identity remains the only auth).",
    "Introducing external CSS frameworks or replacing shadcn/ui components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}